# PAGE_NAME으로 바로 호출 가능하도록 0번째 값을 비워줌
# black formatter 적용하면 안됨(마지막에 콤마 생기는 것때문에 error 발생)
# question_info로 info 정보 분할로 해결하였음, fomatter 사용 가능
testcase_and_result = [
    {"que_number": 0, "lv": "", "kinds": "", "testcase": "", "result": ""},
    {
        "que_number": 1,
        "lv": 0,
        "kinds": "요구사항 구현",
        "testcase": [
            ["   + -- + - + -   "],
            ["   + --- + - +   ", "   + - + - + - +   "],
            [
                "   + -- + - + -   ",
                "   + --- + - +   ",
                "   + -- + - + -   ",
                "   + --- + - +   ",
            ],
            [""],
            [
                "   + -- + - + -   ",
                "   + --- + - +   ",
                "   + -- + - + -   ",
                "   + - + - + - +   ",
            ],
        ],
        "result": ["J", "EU", "JEJE", "welcome", "JEJU"],
    },
    {
        "que_number": 2,
        "lv": 0,
        "kinds": "요구사항 구현",
        "testcase": [[1, 2, 3, 4, 5], [], [1, 3, 5, 7], [2, 3, 4], [2, 4, 6, 8]],
        "result": [120, 0, 105, 24, 384],
    },
    {
        "que_number": 3,
        "lv": 0,
        "kinds": "요구사항 구현",
        "testcase": [[1, 2, 3, 4, 5], [], [1, 3, 5, 7], [2, 3, 4], [2, 4, 6, 8]],
        "result": [7, 0, 8, 6, 14],
    },
    {
        "que_number": 4,
        "lv": 0,
        "kinds": "요구사항 구현",
        "testcase": [
            ["쿠키 1개", "쿠키 2개", "쿠키 3개"],
            ["쿠키 2개", "쿠키 2개", "쿠키 3개"],
            ["쿠키 3개", "쿠키 3개", "쿠키 3개"],
            ["쿠키 3개", "쿠키 2개", "쿠키 5개"],
            ["쿠키 1개", "쿠키 1개", "쿠키 1개"],
        ],
        "result": [14, 15, 18, 22, 6],
    },
    {
        "que_number": 5,
        "lv": 0,
        "kinds": "요구사항 구현",
        "testcase": [
            [1, 2, 3, 4, 5],
            [1, 11, 111, 1111],
            [3, 4, 1, 4, 5],
            [],
            [1, 11, 1, 11],
        ],
        "result": [1, 10, 1, 0, 6],
    },
    {
        "que_number": 6,
        "lv": 0,
        "kinds": "요구사항 구현",
        "testcase": ["1hel2lo3", "1q2w3e4r", "", "hello", "1234"],
        "result": [6, 10, 0, 0, 10],
    },
    {
        "que_number": 7,
        "lv": 0,
        "kinds": "정렬",
        "testcase": [
            [["A", 1], ["B", 2], ["C", 3]],
            [["A", 3], ["B", 2], ["C", 1]],
            [["A", 1], ["B", 3], ["C", 2]],
            [["A", 1], ["B", 3], ["C", 2], ["D", 5], ["E", 4]],
        ],
        "result": [
            ["A", "B", "C"],
            ["C", "B", "A"],
            ["A", "C", "B"],
            ["A", "C", "B", "E", "D"],
        ],
    },
]
